{
    "statistiche": {
        "MAE_train": 4.368968323528339,
        "MSE_train": 35.50288800752208,
        "RMSE_train": 5.958429995185148,
        "MAPE_train": 0.03088807392920003,
        "R2_train": 0.3447812605215005,
        "Spearman_train": 0.6196530342351507,
        "MAE_test": 4.354809938213198,
        "MSE_test": 35.219013476040374,
        "RMSE_test": 5.934560933720403,
        "MAPE_test": 0.030828661176448696,
        "R2_test": 0.36062073886347124,
        "Spearman_test": 0.6338887995876734
    },
    "modello": {
        "class_name": "Sequential",
        "config": {
            "name": "sequential",
            "layers": [
                {
                    "module": "keras.layers",
                    "class_name": "InputLayer",
                    "config": {
                        "batch_input_shape": [
                            null,
                            4
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "ragged": false,
                        "name": "dense_input"
                    },
                    "registered_name": null
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense",
                        "trainable": true,
                        "dtype": "float32",
                        "batch_input_shape": [
                            null,
                            4
                        ],
                        "units": 4,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            4
                        ]
                    }
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_1",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 8,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            4
                        ]
                    }
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_2",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 16,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            8
                        ]
                    }
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_3",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 32,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            16
                        ]
                    }
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_4",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 64,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            32
                        ]
                    }
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_5",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 32,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            64
                        ]
                    }
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_6",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 16,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            32
                        ]
                    }
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_7",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 8,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            16
                        ]
                    }
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_8",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 1,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            8
                        ]
                    }
                }
            ]
        },
        "keras_version": "2.15.0",
        "backend": "tensorflow"
    },
    "normalizzazione": "NoneScaler"
}