{
    "statistiche": {
        "MAE_train": 6.143542667388253,
        "MSE_train": 60.09913903865448,
        "RMSE_train": 7.752363448565506,
        "MAPE_train": 0.043573857276326726,
        "R2_train": 0.2817819567947458,
        "Spearman_train": 0.4947659033115512,
        "MAE_test": 6.298668646572504,
        "MSE_test": 62.640739486622515,
        "RMSE_test": 7.91459029177269,
        "MAPE_test": 0.044433348675764116,
        "R2_test": 0.2555049894112603,
        "Spearman_test": 0.4552861565733927
    },
    "modello": {
        "class_name": "Sequential",
        "config": {
            "name": "sequential_14",
            "layers": [
                {
                    "module": "keras.layers",
                    "class_name": "InputLayer",
                    "config": {
                        "batch_input_shape": [
                            null,
                            5
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "ragged": false,
                        "name": "dense_73_input"
                    },
                    "registered_name": null
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_73",
                        "trainable": true,
                        "dtype": "float32",
                        "batch_input_shape": [
                            null,
                            5
                        ],
                        "units": 4,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            5
                        ]
                    }
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_74",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 32,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            4
                        ]
                    }
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_75",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 64,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            32
                        ]
                    }
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_76",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 32,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            64
                        ]
                    }
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_77",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 1,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            32
                        ]
                    }
                }
            ]
        },
        "keras_version": "2.15.0",
        "backend": "tensorflow"
    },
    "normalizzazione": "NoneScaler"
}