{
    "statistiche": {
        "MAE_train": 3.503988937299672,
        "MSE_train": 20.875266515878877,
        "RMSE_train": 4.568945886731301,
        "MAPE_train": 0.023967285540229016,
        "R2_train": 0.1450957527493122,
        "Spearman_train": 0.43327303674751294,
        "MAE_test": 3.5518716580603726,
        "MSE_test": 21.56501553559247,
        "RMSE_test": 4.64381476111962,
        "MAPE_test": 0.02427137600855562,
        "R2_test": 0.13691239524758714,
        "Spearman_test": 0.4179842657775561
    },
    "modello": {
        "module": "keras",
        "class_name": "Sequential",
        "config": {
            "name": "sequential_1",
            "trainable": true,
            "dtype": "float32",
            "layers": [
                {
                    "module": "keras.layers",
                    "class_name": "InputLayer",
                    "config": {
                        "batch_shape": [
                            null,
                            5
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "name": "input_layer_1"
                    },
                    "registered_name": null
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_5",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 4,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            5
                        ]
                    }
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_6",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 32,
                        "activation": "elu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            4
                        ]
                    }
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_7",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 32,
                        "activation": "elu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            32
                        ]
                    }
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_8",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 32,
                        "activation": "elu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            32
                        ]
                    }
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_9",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 1,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            32
                        ]
                    }
                }
            ],
            "build_input_shape": [
                null,
                5
            ]
        },
        "registered_name": null,
        "build_config": {
            "input_shape": [
                null,
                5
            ]
        },
        "compile_config": {
            "optimizer": "RMSprop",
            "loss": "mse",
            "loss_weights": null,
            "metrics": [
                "mae"
            ],
            "weighted_metrics": null,
            "run_eagerly": false,
            "steps_per_execution": 1,
            "jit_compile": false
        }
    },
    "normalizzazione": "NoneScaler"
}