{
    "statistiche": {
        "MAE_train": 141.78829446644284,
        "MSE_train": 20158.10523496288,
        "RMSE_train": 141.97924226788535,
        "MAPE_train": 1.0,
        "R2_train": -371.025180022789,
        "Spearman_train": "NaN",
        "MAE_test": 141.66690784673628,
        "MSE_test": 20124.595912790046,
        "RMSE_test": 141.86118536368588,
        "MAPE_test": 1.0,
        "R2_test": -364.349508558624,
        "Spearman_test": "NaN"
    },
    "modello": {
        "class_name": "Sequential",
        "config": {
            "name": "sequential",
            "layers": [
                {
                    "module": "keras.layers",
                    "class_name": "InputLayer",
                    "config": {
                        "batch_input_shape": [
                            null,
                            4
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "ragged": false,
                        "name": "dense_input"
                    },
                    "registered_name": null
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense",
                        "trainable": true,
                        "dtype": "float32",
                        "batch_input_shape": [
                            null,
                            4
                        ],
                        "units": 128,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            4
                        ]
                    }
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_1",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 128,
                        "activation": "tanh",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            128
                        ]
                    }
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_2",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 1,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            128
                        ]
                    }
                }
            ]
        },
        "keras_version": "2.15.0",
        "backend": "tensorflow"
    }
}