{
    "statistiche": {
        "MAE_train": 4.8139971869192495,
        "MSE_train": 41.68248990305533,
        "RMSE_train": 6.456197789957749,
        "MAPE_train": 0.0328776591617345,
        "R2_train": 0.5789243995418413,
        "Spearman_train": 0.8100806451612904,
        "MAE_test": 4.819057968019454,
        "MSE_test": 45.507564428656266,
        "RMSE_test": 6.745929471070407,
        "MAPE_test": 0.033748879282897846,
        "R2_test": 0.2841527601955951,
        "Spearman_test": 0.5714285714285715
    },
    "modello": {
        "module": "keras",
        "class_name": "Sequential",
        "config": {
            "name": "sequential",
            "trainable": true,
            "dtype": "float32",
            "layers": [
                {
                    "module": "keras.layers",
                    "class_name": "InputLayer",
                    "config": {
                        "batch_shape": [
                            null,
                            5
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "name": "input_layer"
                    },
                    "registered_name": null
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 4,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            5
                        ]
                    }
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_1",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 64,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            4
                        ]
                    }
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_2",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 64,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            64
                        ]
                    }
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_3",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 1,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            64
                        ]
                    }
                }
            ],
            "build_input_shape": [
                null,
                5
            ]
        },
        "registered_name": null,
        "build_config": {
            "input_shape": [
                null,
                5
            ]
        },
        "compile_config": {
            "optimizer": "adam",
            "loss": "mse",
            "loss_weights": null,
            "metrics": [
                "mae"
            ],
            "weighted_metrics": null,
            "run_eagerly": false,
            "steps_per_execution": 1,
            "jit_compile": false
        }
    },
    "normalizzazione": "NoneScaler"
}