{
    "statistiche": {
        "MAE_train": 3.4966365294586548,
        "MSE_train": 23.395196456607795,
        "RMSE_train": 4.836858118304463,
        "MAPE_train": 0.024573550505377708,
        "R2_train": 0.568233121516688,
        "Spearman_train": 0.7352651475708589,
        "MAE_test": 3.4666314142945263,
        "MSE_test": 22.594596014580024,
        "RMSE_test": 4.7533773271832755,
        "MAPE_test": 0.024380543450834232,
        "R2_test": 0.58980917749702,
        "Spearman_test": 0.7421429824454504
    },
    "modello": {
        "module": "keras",
        "class_name": "Sequential",
        "config": {
            "name": "sequential_2",
            "trainable": true,
            "dtype": "float32",
            "layers": [
                {
                    "module": "keras.layers",
                    "class_name": "InputLayer",
                    "config": {
                        "batch_shape": [
                            null,
                            5
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "name": "input_layer_2"
                    },
                    "registered_name": null
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_10",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 4,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            5
                        ]
                    }
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_11",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 32,
                        "activation": "elu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            4
                        ]
                    }
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_12",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 32,
                        "activation": "elu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            32
                        ]
                    }
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_13",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 32,
                        "activation": "elu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            32
                        ]
                    }
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_14",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 1,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            32
                        ]
                    }
                }
            ],
            "build_input_shape": [
                null,
                5
            ]
        },
        "registered_name": null,
        "build_config": {
            "input_shape": [
                null,
                5
            ]
        },
        "compile_config": {
            "optimizer": "RMSprop",
            "loss": "mse",
            "loss_weights": null,
            "metrics": [
                "mae"
            ],
            "weighted_metrics": null,
            "run_eagerly": false,
            "steps_per_execution": 1,
            "jit_compile": false
        }
    },
    "normalizzazione": "NoneScaler"
}